NotesB4/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ra"], ["password", "ra"], ["created_at", "2019-03-19 10:00:45.155026"], ["updated_at", "2019-03-19 10:00:45.155026"]]
---
  def create
    @user = User.new(user_params)
    if @user.save