app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)
    byebug
    @note.image.attach(note_params[:image])
    #byebug

    respond_to do |format|
      @note.user=User.find_by name: note_params[:user_id]

      if @note.save
---
INSERT INTO "notes" ("text", "user_id", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?, ?)  [["text", "gwtrhrthhwrtjyn"], ["user_id", 1], ["created_at", "2019-03-19 10:03:50.884286"], ["updated_at", "2019-03-19 10:03:50.884286"], ["title", "Lista de la compra"]]

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "this is a note"], ["text", "trying edit function"], ["updated_at", "2019-03-20 11:45:44.797770"], ["id", 3]]